# vsoEIDataGetContext

## Description
Gets the equipment item data context from the ParametricEquipmentItemDataMessage(92) message sent to a Script object.

```pascal
FUNCTION vsoEIDataGetContext(message : LONGINT) : INTEGER;
```

```python

def vs.vsoEIDataGetContext(message):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message|LONGINT||

## Version
Availability: from Vectorworks 2023.4
## Category
* Object Events